README.org
#+TITLE: My Emacs config
#+Author: Yojan Gautam
#+Email: gautamyojan0@gmail.com
#+Options: num:nil

* Emacs Config

** Motivation
Having a proper system to organize your life and notes is
crucial. As a Computer Engineering student, I learn a lot of new topics
every day. So far I have been able to keep them in my mind, there has
been multiple times when I said to myself "only if I had the notes from
that one time when I already solved this problem". Having a proper system
that allows me to easily retrive information that I already solved will
save a lot of time.

** Requirements
Since my works consists of developing, researching, writing, and managing
each part will have its own requirements.

*** Package manager
#+begin_src
   (defvar bootstrap-version)
   (let ((bootstrap-file
          (expand-file-name
           "straight/repos/straight.el/bootstrap.el"
           (or (bound-and-true-p straight-base-dir)
               user-emacs-directory)))
         (bootstrap-version 7))
     (unless (file-exists-p bootstrap-file)
       (with-current-buffer
           (url-retrieve-synchronously
            "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
            'silent 'inhibit-cookies)
         (goto-char (point-max))
         (eval-print-last-sexp)))
     (load bootstrap-file nil 'nomessage))

  (straight-use-package 'org)
   ;;(setq package-enable-at-startup nil)
   ;; Initialize package sources
   (require 'package)

   (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                            ("org" . "https://orgmode.org/elpa/")
                            ("elpa" . "https://elpa.gnu.org/packages/")))

   ;;(package-initialize)
   (unless package-archive-contents
    (package-refresh-contents))

   ;; Initialize use-package on non-Linux platforms
   (unless (package-installed-p 'use-package)
      (package-install 'use-package))

   (require 'use-package)

#+end_src

*** Path Management
#+begin_src emacs-lisp
(setenv "PATH" "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/snap/bin:/usr/local/go/bin:/usr/share/:/Library/TeX/texbin/:/Users/DTR/Library/Python/3.9/bin/:/opt/homebrew/bin/")
(setq exec-path (append '("/usr/local/go/bin" "/usr/bin/jdt-language-server/bin" "/Library/TeX/texbin/" "/Users/DTR/Library/Python/3.9/bin/" "/opt/homebrew/bin/")
                        exec-path))
 #+end_src

*** Adding Projectile for Project Management
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
                ("s-p" . projectile-command-map)
                ("C-c p" . projectile-command-map)))

  (setq projectile-project-search-path '("~/Blimp/" "~/Blimp-Senior-Design/" "~/RDC/" ("~/git" . 1)))
  
(use-package perspective
  :straight t
  :bind
  ("C-x C-b" . persp-list-buffers)         ; or use a nicer switcher, see below
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))  ; pick your own prefix key here
  :init
  (persp-mode))

#+end_src

*** Evil and Key binds
I cannot live with vim keybinds so here we go
#+begin_src emacs-lisp
        (use-package general
          :ensure t)
        (use-package evil
          :ensure t
          :init
          (setq evil-want-keybinding nil)
          (setq evil-want-integration t)
          :config
          (evil-mode 1))

        (use-package evil-collection
          :after evil
          :ensure t
          :config
          (evil-collection-init))
(require 'org-tempo)

  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
    
        (require 'general)

        (general-create-definer my-leader-def
          :prefix "SPC")
      ;; ** Global Keybindings
      (my-leader-def
        :keymaps 'normal
        ;; bind "SPC a"
        "a" 'org-agenda
      ;;  "b" 'counsel-bookmark
        "c" 'org-capture
        "SPC" 'projectile-find-file
        "fp" 'projectile-switch-project
        "gp" 'projectile-grep
        "ff" 'find-file
        "wl" 'evil-window-right
        "wh" 'evil-window-left
        "wk" 'evil-window-up
        "wj" 'evil-window-down
        "wv" 'evil-window-vnew
        "ws" 'evil-window-new
        "wq" 'evil-quit
        "eb" 'eval-buffer
        "op" 'neotree
        "ot" 'vterm
        "bb" 'ibuffer-jump
        "]" 'evil-next-buffer
        "[" 'evil-prev-buffer
        "ti" 'org-clock-in
        "to" 'org-clock-out
        "/" 'comment-line
        "x" 'helm-M-x
        "rf" 'org-roam-node-find
        "bk" 'kill-buffer
        )

    ;;  (define-key evil-normal-state-map (kbd "RET") 'org-toggle-todo-and-fold)
    ;;(define-key evil-normal-state-map (kbd "S") 'comment-line)
    (defun drmoscovium/dont-arrow ()
      (interactive)
      (message "Arrow keys are bad, you know?"))

    (define-key evil-normal-state-map (kbd "<left>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<right>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<down>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<up>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<left>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<right>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<down>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<up>") 'drmoscovium/dont-arrow)


#+end_src

