README.el
(setenv "PATH" "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/snap/bin:/usr/local/go/bin:/usr/share/:/Library/TeX/texbin/:/Users/DTR/Library/Python/3.9/bin/")
(setq exec-path (append '("/usr/local/go/bin" "/usr/bin/jdt-language-server/bin" "/Library/TeX/texbin/" "/Users/DTR/Library/Python/3.9/bin/")
                        exec-path))

(use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
                ("s-p" . projectile-command-map)
                ("C-c p" . projectile-command-map)))

  (setq projectile-project-search-path '("~/Blimp/" "~/Blimp-Senior-Design/" "~/RDC/" ("~/git" . 1)))
  
(use-package perspective
  :straight t
  :bind
  ("C-x C-b" . persp-list-buffers)         ; or use a nicer switcher, see below
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))  ; pick your own prefix key here
  :init
  (persp-mode))

(use-package general
          :ensure t)
        (use-package evil
          :ensure t
          :init
          (setq evil-want-keybinding nil)
          (setq evil-want-integration t)
          :config
          (evil-mode 1))

        (use-package evil-collection
          :after evil
          :ensure t
          :config
          (evil-collection-init))
(require 'org-tempo)

  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
    
        (require 'general)

        (general-create-definer my-leader-def
          :prefix "SPC")
      ;; ** Global Keybindings
      (my-leader-def
        :keymaps 'normal
        ;; bind "SPC a"
        "a" 'org-agenda
      ;;  "b" 'counsel-bookmark
        "c" 'org-capture
        "SPC" 'projectile-find-file
        "fp" 'projectile-switch-project
        "gp" 'projectile-grep
        "ff" 'find-file
        "wl" 'evil-window-right
        "wh" 'evil-window-left
        "wk" 'evil-window-up
        "wj" 'evil-window-down
        "wv" 'evil-window-vnew
        "ws" 'evil-window-new
        "wq" 'evil-quit
        "eb" 'eval-buffer
        "op" 'treemacs
        "ot" 'vterm
        "bb" 'ibuffer-jump
        "]" 'evil-next-buffer
        "[" 'evil-prev-buffer
        "ti" 'org-clock-in
        "to" 'org-clock-out
        "/" 'comment-line
        "x" 'helm-M-x
        "rf" 'org-roam-node-find
        "bk" 'kill-buffer
        )

    ;;  (define-key evil-normal-state-map (kbd "RET") 'org-toggle-todo-and-fold)
    ;;(define-key evil-normal-state-map (kbd "S") 'comment-line)
    (defun drmoscovium/dont-arrow ()
      (interactive)
      (message "Arrow keys are bad, you know?"))

    (define-key evil-normal-state-map (kbd "<left>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<right>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<down>") 'drmoscovium/dont-arrow)
    (define-key evil-normal-state-map (kbd "<up>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<left>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<right>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<down>") 'drmoscovium/dont-arrow)
    (evil-global-set-key 'motion (kbd "<up>") 'drmoscovium/dont-arrow)
