README.org
*** UI
Some default to keep me sane
#+begin_src emacs-lisp
            (setq inhibit-startup-screen t)
            (setq inhibit-startup-echo-area-message t)
            (setq inhibit-startup-message t)
            (setq initial-scratch-message nil)
            (setq initial-major-mode 'org-mode)
            (menu-bar-mode 0)
            (setq line-number-mode t)
            (setq-default indent-tabs-mode nil)
            (setq pop-up-windows nil)
            (tool-bar-mode 0)
            (tooltip-mode  0)
            (scroll-bar-mode 0)
(add-hook 'image-mode-hook
  (lambda ()
    (auto-revert-mode)
    (auto-image-file-mode)))

  ;; use-package with package.el:
  (use-package dashboard
    :straight t
    :config
    (dashboard-setup-startup-hook))

            (use-package which-key
            :straight t
              :init (which-key-mode)
              :diminish which-key-mode
              :config
              (setq which-key-idle-delay 0.3))

            (use-package eterm-256color
              :hook (term-mode . eterm-256color-mode))

            (use-package all-the-icons-dired
        :straight t
              :hook (dired-mode . all-the-icons-dired-mode))



    (set-frame-font "JetBrainsMono Nerd Font Mono 14" nil t)


            (use-package ido-vertical-mode
          :straight t
          )
            (require 'ido-vertical-mode)
            (ido-mode 1)
            (ido-vertical-mode 1)

            (use-package helm :straight t)

            (use-package popper
              :ensure t ; or :straight t
              :bind (("C-`"   . popper-toggle)
                     ("M-`"   . popper-cycle)
                     ("C-M-`" . popper-toggle-type))
              :init
              (setq popper-reference-buffers
                    '("\\*Messages\\*"
                  "\\*vterm\\*"
                      "Output\\*$"
                      "\\*Async Shell Command\\*"
                      help-mode
                      compilation-mode))
              (popper-mode +1)
              (popper-echo-mode +1))                ; For echo area hints


            (use-package dired
              :ensure nil
              :commands (dired dired-jump)
              :bind (("C-x C-j" . dired-jump))
              :config
              (evil-collection-define-key 'normal 'dired-mode-map
                "h" 'dired-up-directory
                "l" 'dired-find-file))

            (use-package dired-single
      :ensure t)


            (use-package tree-sitter
        :straight t
        )
            (use-package tree-sitter-langs
    :straight t
    )
            (require 'tree-sitter)
            (require 'tree-sitter-langs)
            ;; (use-package evil-nerd-commenter
            ;;   :bind ("gcc" . evilnc-comment-or-uncomment-lines))

            (setq backup-directory-alist            '((".*" . "~/.Trash")))



#+end_src

I like to keep my ui minimal, and nano emacs is perfect for this.

#+begin_src emacs-lisp
      ;; (straight-use-package
          ;; '(nano :type git :host github :repo "rougier/nano-emacs"))
        (straight-use-package
          '(org-margin :type git :host github :repo "rougier/org-margin"))
        (require 'org-margin)

        (straight-use-package
         '(svg-tag-mode :type git :host github :repo "rougier/svg-tag-mode"))
        (require 'svg-tag-mode)
      (svg-tag-mode 1)

        (setq svg-tag-tags
              '(("TODO" . ((lambda (tag) (svg-tag-make tag))))))

      (setq svg-tag-tags
            '(("DONE" . ((lambda (tag) (svg-tag-make tag))))))

      (setq svg-tag-tags
            '(("CANCLED" . ((lambda (tag) (svg-tag-make tag))))))


#+end_src

#+begin_src emacs-lisp
  (use-package olivetti
    :straight t
    )
  (require 'olivetti)

#+end_src

Adding doom themes

#+begin_src
    (use-package modus-themes
      :straight t
      )
    (require 'modus-themes)
  (modus-themes-select 'modus-operandi-tinted )            ; Light theme

#+end_src

#+begin_src
    (use-package doom-themes
      :ensure t
      :config
      ;; Global settings (defaults)
      (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
            doom-themes-enable-italic t) ; if nil, italics is universally disabled
      (load-theme 'doom-one t)

      ;; Enable flashing mode-line on errors
      (doom-themes-visual-bell-config)
      ;; Enable custom neotree theme (all-the-icons must be installed!)
      (doom-themes-neotree-config)
      ;; or for treemacs users
      (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
      (doom-themes-treemacs-config)
      ;; Corrects (and improves) org-mode's native fontification.
      (doom-themes-org-config))
 #+end_src

#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode))
#+end_src

#+begin_src emacs-lisp

  (use-package neotree
    :straight t)
  (require 'neotree)

#+end_src


  Config for side buffer, I don't think I will use it tho
#+begin_src
  (defun ibuffer-advice (format)
    (with-current-buffer "*Ibuffer*"
      (save-excursion
      (let ((inhibit-read-only t))

        ;; Remove header and insert ours
        (goto-char (point-min))
        (search-forward "-\n" nil t)
        (delete-region 1 (point))
        (goto-char (point-min))
        (insert (concat
                 (propertize "\n" 'face '(:height 1.2))
                 (propertize " "  'display `(raise +0.25))
                 (propertize "  Buffers list (ibuffer)"
                             'face 'nano-faded)
                 (propertize " "  'display `(raise -0.35))
                 "\n"))
        (insert "")

        ;; Transform titles
        (goto-char (point-min))
        (while (re-search-forward "\\[ \\(.*\\) \\]" nil t)
          (let* ((title (match-string 0))
                 (property (get-text-property 0 'ibuffer-filter-group-name title)))
            (replace-match "\n")
            (insert (concat
                     (propertize
                      (format "   %s " (substring title 2 -2))
                      'ibuffer-filter-group-name property)
                     (propertize
                      (make-string (- 30 (length title)) ?—)
                      'face 'nano-faded)
                     "\n"))))))))


  (setq ibuffer-saved-filter-groups
         '(("home"
                ("Configuration" (or (filename . ".emacs.d")
                                             (filename . "emacs-config")))
                ("Org" (or (mode . org-mode)
                               (filename . "OrgMode")))
            ("Code" (or  (derived-mode . prog-mode)
                         (mode . ess-mode)
                         (mode . compilation-mode)))
            ("Text" (and (derived-mode . text-mode)
                         (not  (starred-name))))
            ("TeX"  (or (derived-mode . tex-mode)
                        (mode . latex-mode)
                        (mode . context-mode)
                        (mode . ams-tex-mode)
                        (mode . bibtex-mode)))
                ("Help" (or (name . "\*Help\*")
                                (name . "\*Apropos\*")
                                (name . "\*info\*"))))))

  (setq ibuffer-show-empty-filter-groups nil)
  (setq ibuffer-display-summary nil)
  (setq ibuffer-use-header-line nil)
  (setq ibuffer-eliding-string (propertize "…" 'face 'nano-salient))
  (setq ibuffer-fontification-alist '((0 t nano-salient)))
  (setq ibuffer-formats
        '(("  "  mark " "(name 24 24 :left :elide) "  " modified)
          (mark " " (name 16 -1) " " filename)))

  (defun ibuffer-setup ()
    (ibuffer-switch-to-saved-filter-groups "home")
    (ibuffer-auto-mode 1))

  (defun nano-sidebar-init-ibuffer (frame sidebar)
    "Default sidebar initialization"

    (select-frame frame)
    (let ((buffer (current-buffer)))
      (ibuffer)
      (switch-to-buffer buffer))
    (select-frame sidebar)
    (switch-to-buffer "*Ibuffer*")
    (set-window-dedicated-p (get-buffer-window "*Ibuffer*") t)
    (hl-line-mode)
    (setq header-line-format nil)
    (setq mode-line-format nil))


  (setq nano-sidebar-default-init 'nano-sidebar-init-ibuffer)
  (advice-add 'ibuffer-update-title-and-summary :after #'ibuffer-advice)
  (add-hook 'ibuffer-mode-hook #'ibuffer-setup)

#+end_src

