README.org
*** Developing
eglot is the default lsp client for emacs from v29 and I will be using
it.

#+begin_src emacs-lisp
        (require 'eglot)
      (use-package company
        :ensure t
      :init (global-company-mode)
      )
        (require 'company)
        (straight-use-package
         '(yasnippet :type git :host github :repo "joaotavora/yasnippet"))

  (straight-use-package
         '(origami :type git :host github :repo "gregsexton/origami.el"))
  (require 'origami)

      (require 'yasnippet)
    (use-package yasnippet-snippets
      :straight t)

  (yas-reload-all)
      (yas-global-mode 1)

  (use-package magit
    :straight t
    )

  (use-package eldoc-box
    :straight t
    )
  (add-hook 'eglot-managed-mode-hook #'eldoc-box-hover-at-point-mode t)
#+end_src

The languages that I use often are:
1. Python
2. Go
3. JS
4. C++
5. Rust
6. Elisp
7. VHDL/Verilog
8. Java
**** Rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :straight t
    :init
    (setq rust-mode-treesitter-derive t))
    (add-hook 'rust-mode-hook 'eglot-ensure)
    (add-hook 'rust-mode-hook
            (lambda () (setq indent-tabs-mode nil)))
#+end_src

**** Go
#+begin_src emacs-lisp
       (use-package go-mode
      :straight t)
    (require 'go-mode)
          (require 'project)

        (defun project-find-go-module (dir)
          (when-let ((root (locate-dominating-file dir "go.mod")))
            (cons 'go-module root)))
(defun eglot-format-buffer-on-save ()
  (add-hook 'before-save-hook #'eglot-format-buffer -10 t))
(add-hook 'go-mode-hook #'eglot-format-buffer-on-save)

        (cl-defmethod project-root ((project (head go-module)))
          (cdr project))

        (add-hook 'project-find-functions #'project-find-go-module)

  (setq-default eglot-workspace-configuration
      '((:gopls .
          ((staticcheck . t)
           (matcher . "CaseSensitive")))))


    (add-hook 'go-mode-hook 'eglot-ensure)
  (add-hook 'before-save-hook
      (lambda ()
          (call-interactively 'eglot-code-action-organize-imports))
      nil t)



#+end_src

**** Cpp

#+BEGIN_quote 
     (add-to-list 'auto-mode-alist '("\\.h\\'" . c-or-c++-mode)
  '("\\.cpp\\'" . c-or-c++-mode)
  '("\\.c\\'" .  c-or-c++-mode)
    )

  (add-hook 'c-or-c++-mode-hook 'eglot-ensure)

#+END_quote
Platformio is great tool for embedded development, using my fork because
  I want to change some of the config on it.
  
#+BEGIN_COMMENT
  (straight-use-package platformio-mode
    '(platformio-mode :type git :host github :repo "Super-Yojan/PlatformIO-Mode")
    )
      (require 'platformio-mode)
#+END_COMMENT

The easiest 

**** Python
#+begin_src emacs-lisp
    (use-package python-mode
    :straight t
      :custom
    (python-shell-interpreter "python3")
    :hook (python-mode . eglot-ensure))

    (use-package auto-virtualenv
  :straight t)
    (require 'auto-virtualenv)
  (add-hook 'python-mode-hook 'auto-virtualenv-set-virtualenv)

#+end_src

**** Java
#+begin_src emacs-lisp
  (use-package eglot-java
    :straight t
    )
  (add-hook 'java-mode-hook 'eglot-java-mode)


#+end_src
**** TypeScript
#+begin_src emacs-lisp
;; if you use treesitter based typescript-ts-mode (emacs 29+)
(use-package tide
  :straight t
  :after (company flycheck)
  :hook ((typescript-ts-mode . tide-setup)
         (tsx-ts-mode . tide-setup)
         (typescript-ts-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save)))
#+end_src
*** Note Taking

1. Be able to capture any idea that comes to my head, and look at it later.
**** Org Roam
#+begin_src  emacs-lisp
(setq org-startup-folded t)

  (use-package org-roam
  :straight (:host github :repo "org-roam/org-roam"
             :files (:defaults "extensions/*"))
  )
  (require 'org-roam)
  (setq org-roam-directory (file-truename "~/RoamNotes"))
  (org-roam-db-autosync-mode)
#+end_src

**** Organizing Life with Org
#+begin_src emacs-lisp
        (setq org-agenda-files (quote ("~/org/todo.org"
                                       "~/org/inbox.org"
                                    )))

          (add-hook 'org-mode-hook 'org-modern-mode)
    (setq org-default-notes-file "~/org/inbox.org")
    (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))

      (setq org-todo-keywords
            (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                    (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))

      (setq org-todo-keyword-faces
            (quote (("TODO" :foreground "red" :weight bold)
                    ("NEXT" :foreground "blue" :weight bold)
                    ("DONE" :foreground "forest green" :weight bold)
                    ("WAITING" :foreground "orange" :weight bold)
                    ("HOLD" :foreground "magenta" :weight bold)
                    ("CANCELLED" :foreground "forest green" :weight bold)
                    ("MEETING" :foreground "forest green" :weight bold)
                      ("PHONE" :foreground "forest green" :weight bold))))

    (setq org-capture-templates
           '(("t" "todo" entry (file org-default-notes-file)
    	  "* TODO %?\n%u\n%a\n" :clock-in t :clock-resume t)
    	 ("m" "Meeting" entry (file org-default-notes-file)
    	  "* MEETING with %? :MEETING:\n%t" :clock-in t :clock-resume t)
    	 ("d" "Diary" entry (file+datetree "~/org/diary.org")
    	  "* %?\n%U\n" :clock-in t :clock-resume t)
    	 ("i" "Idea" entry (file org-default-notes-file)
    	  "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
    	 ("n" "Next Task" entry (file+headline org-default-notes-file "Tasks")
    	  "** NEXT %? \nDEADLINE: %t") ))
      
#+end_src
