README.org
**** Org-Present

#+begin_src 
(set-frame-parameter (selected-frame) 'alpha '(97 . 100))
(add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (defvar my/variable-width-font "JetBrainsMono Nerd Font Mono")
  (defvar my/fixed-width-font "JetBrainsMono Nerd Font Mono")
    ;; Org Mode Appearance ------------------------------------

    ;; Load org-faces to make sure we can set appropriate faces
    (require 'org-faces)

    ;; Hide emphasis markers on formatted text
    (setq org-hide-emphasis-markers t)

    ;; Resize Org headings
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font my/variable-width-font :weight 'medium :height (cdr face)))

    ;; Make the document title a bit bigger
    (set-face-attribute 'org-document-title nil :font my/variable-width-font :weight 'bold :height 1.3)

    ;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

    ;;; Centering Org Documents --------------------------------

    ;; Install visual-fill-column
    (unless (package-installed-p 'visual-fill-column)
      (package-install 'visual-fill-column))

    ;; Configure fill width
    (setq visual-fill-column-width 110
          visual-fill-column-center-text t)

    ;;; Org Present --------------------------------------------

    ;; Install org-present if needed
    (unless (package-installed-p 'org-present)
      (package-install 'org-present))

    (defun my/org-present-prepare-slide (buffer-name heading)
      ;; Show only top-level headlines
      (org-overview)

      ;; Unfold the current entry
      (org-show-entry)

      ;; Show only direct subheadings of the slide but don't expand them
      (org-show-children))

    (defun my/org-present-start ()
      ;; Tweak font sizes
      (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                         (header-line (:height 4.0) variable-pitch)
                                         (org-document-title (:height 1.75) org-document-title)
                                         (org-code (:height 1.55) org-code)
                                         (org-verbatim (:height 1.55) org-verbatim)
                                         (org-block (:height 1.25) org-block)
                                         (org-block-begin-line (:height 0.7) org-block)))

      ;; Set a blank header line string to create blank space at the top
      (setq header-line-format " ")

      ;; Display inline images automatically
      (org-display-inline-images)

      ;; Center the presentation and wrap lines
      (visual-fill-column-mode 1)
      (visual-line-mode 1))

    (defun my/org-present-end ()
      ;; Reset font customizations
      (setq-local face-remapping-alist '((default variable-pitch default)))

      ;; Clear the header line string so that it isn't displayed
      (setq header-line-format nil)

      ;; Stop displaying inline images
      (org-remove-inline-images)

      ;; Stop centering the document
      (visual-fill-column-mode 0)
      (visual-line-mode 0))

    ;; Turn on variable pitch fonts in Org Mode buffers
    (add-hook 'org-mode-hook 'variable-pitch-mode)

    ;; Register hooks with org-present
    (add-hook 'org-present-mode-hook 'my/org-present-start)
    (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
    (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)
#+end_src

**** Org-hugo
#+begin_src
(use-package ox-hugo
  :straight t   ;Auto-install the package from Melpa
  :pin melpa  ;`package-archives' should already have ("melpa" . "https://melpa.org/packages/")
  :after ox)
#+end_src


**** Latex-preview-plane

#+begin_src emacs-lisp
  (use-package latex-preview-pane
    :straight t)

  (latex-preview-pane-enable)

   (straight-use-package
              '(org-auctex :type git :host github :repo "karthink/org-auctex"))
            (require 'org-auctex)


#+end_src


**** Org-modern
#+begin_src
  (straight-use-package
              '(org-modern :type git :host github :repo "minad/org-modern"))
            (require 'org-modern)


    
      ;; Minimal UI
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    ;; (modus-themes-load-operandi)
  
    ;; Choose some fonts
    (set-face-attribute 'default nil :family "JetBrainsMono Nerd Font Mono 14")
    (set-face-attribute 'variable-pitch nil :family "JetBrainsMono Nerd Font Mono 14")
    (set-face-attribute 'org-modern-symbol nil :family "JetBrainsMono Nerd Font Mono 14")

    ;; Add frame borders and window dividers
    ;; (modify-all-frames-parameters
     ;; '((right-divider-width . 40)
       ;; (internal-border-width . 40)))
    (dolist (face '(window-divider
                    window-divider-first-pixel
                    window-divider-last-pixel))
      (face-spec-reset-face face)
      (set-face-foreground face (face-attribute 'default :background)))
    (set-face-background 'fringe (face-attribute 'default :background))

    (setq
     ;; Edit settings
     org-auto-align-tags nil
     org-tags-column 0
     org-catch-invisible-edits 'show-and-error
     org-special-ctrl-a/e t
     org-insert-heading-respect-content t

     ;; Org styling, hide markup etc.
     org-hide-emphasis-markers t
     org-pretty-entities t

     ;; Agenda styling
     org-agenda-tags-column 0
     org-agenda-block-separator ?─
     org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
     org-agenda-current-time-string
     "◀── now ─────────────────────────────────────────────────")

    ;; Ellipsis styling
    (setq org-ellipsis "…")
    (set-face-attribute 'org-ellipsis nil :inherit 'default :box nil)

    (global-org-modern-mode)

#+end_src

**** Org-bable
#+begin_src
    ;; (require 'org-babel)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (python . t)
     ;; (ipython . t)
     (sh . t)
     (shell . t)
     ;; Include other languages here...
     ))
  ;; Syntax highlight in #+BEGIN_SRC blocks
  (setq org-src-fontify-natively t)
  ;; Don't prompt before running code in org
  (setq org-confirm-babel-evaluate nil)
  ;; Fix an incompatibility between the ob-async and ob-ipython packages
  ;; (setq ob-async-no-async-languages-alist '("ipython"))

#+end_src

**** Ob-marmaid
#+begin_src
;;   (straight-use-package
 ;;        '(ob-mermaid :type git :host github :repo "arnm/ob-mermaid"))

(use-package ob-mermaid
	:ensure t)
  (require 'ob-mermaid)
  (setq ob-mermaid-cli-path "/home/ygautam/.nvm/versions/node/v22.5.1/bin/mmdc")


#+end_src

*** Email
#+begin_src
  (use-package mu4e
    :straight t
    )
#+end_src
